{
  "name": "Nathan Bird",
  "contact": {
    "location": "Rexburg, ID",
    "email": "nathanbirdka@gmail.com",
    "phone": "(385) 392-5995"
  },
  "bio": "Software Engineering Student at Brigham Young University-Idaho",
  "websites": [
    {
      "name": "YouTube",
      "url": "https://www.youtube.com/@NathanBird"
    },
    {
      "name": "GitHub",
      "url": "https://github.com/nbird11"
    },
    {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/nathanabird/"
    },
    {
      "name": "Personal Webserver",
      "url": "https://nbird.dev/"
    }
  ],
  "about": "I'm a Software Engineering student at BYU–Idaho, set to graduate at the end of this upcoming July. I'm particularly interested in (some) software design patterns and in recreating the performance/efficiency of systems-level concepts.\nIn a recent professional role, I interned as a Backend Web Developer at FamilySearch, where I built and maintained backend REST APIs, developed a large-scale web crawler for the Paris 2024 Olympics, and delivered production-level code that I was told was rarely assigned to interns. I’ve also worked as a programming tutor and research assistant where I mentored peers and contributed to mobile app development research for my university.\nI'm highly adaptable and love to learn; I especially enjoy working on personal programming projects that allow me to explore new technologies and expand my technical breadth. Outside of tech, I enjoy board games, playing piano, choral singing, and editorial writing.\nI served a proselyting mission for the Church of Jesus Christ of Latter-day Saints during the COVID pandemic, where I taught, performed service, and provided spiritual aid in Colorado and Brazil, in both English and Portuguese.\nI am currently seeking full-time opportunities.",
  "education": [
    {
      "logo": "/resume/assets/byu_idaho_logo.jpeg",
      "institution": "Brigham Young University-Idaho",
      "degree": "Bachelor of Science in Software Engineering",
      "start": "2019",
      "end": "2025",
      "gpa": "3.98",
      "activities": [
        "Certificate in Software Design",
        "Awarded full-ride BYU–Idaho Scholarship for academic excellence (top percentile GPA, 3.98)"
      ]
    },
    {
      "logo": "/resume/assets/santa_teresa_hs_logo.jpeg",
      "institution": "Santa Teresa High School",
      "degree": "High School Diploma",
      "start": "2015",
      "end": "2019",
      "gpa": null,
      "activities": [
        "Computer Science Club",
        "Marching Band"
      ]
    }
  ],
  "experience": [
    {
      "logo": "/resume/assets/byu_idaho_logo.jpeg",
      "title": "Programming Tutor",
      "company": "Brigham Young University–Idaho",
      "employmentType": "Seasonal",
      "start": "Sep 2023",
      "end": "Feb 2025",
      "location": "Rexburg, Idaho, United States",
      "locationType": "On-site",
      "bullets": [
        "Mentored 40+ students across 8 university-level courses over 5 semesters, analyzing ~75K lines of code",
        "Facilitated 100+ sessions covering software design principles in Python, C, C++, SQL, HTML, CSS, and JavaScript, creating custom walkthroughs from prior high-scoring coursework to reinforce key concepts",
        "Broke down code involving drag force, Mach number, gravity at altitude, and linear interpolation into simple steps for students in a notorious C++ physics simulation course",
        "Demonstrated technical mastery and strong communication—one student sought my guidance through 3 advanced successive courses and offered private compensation over free university alternatives after my official role ended"
      ]
    },
    {
      "logo": "/resume/assets/familysearch_logo.jpeg",
      "title": "Backend Development Intern",
      "company": "FamilySearch",
      "employmentType": "Internship",
      "start": "Apr 2024",
      "end": "Aug 2024",
      "location": "Lehi, Utah, United States",
      "locationType": "Hybrid",
      "bullets": [
        "Selected for 1 of only 2 backend intern roles from a pool of 30+ web/QA candidates",
        "Recognized for exceeding expectations and trusted to write production-level code typically reserved for full-time engineers",
        "Developed and maintained 7 REST APIs and microservices in Java Spring Boot, contributing 2K+ lines of production code",
        "Designed and deployed a web crawler that ran for 9 hours overnight gathering data on 65K+ Olympians for a 2024 Paris Olympics initiative, directly enabling Olympic content search capabilities for the site",
        "Authored ~800 unit/integration tests with Spring Boot and Mockito, increasing coverage to 95%+ across 7 services"
      ]
    },
    {
      "logo": "/resume/assets/byu_idaho_logo.jpeg",
      "title": "Research Assistant",
      "company": "Brigham Young University–Idaho",
      "employmentType": "Part-time",
      "start": "Dec 2023",
      "end": "May 2024",
      "location": "Rexburg, Idaho, United States",
      "locationType": "Remote",
      "bullets": [
        "Built ~15K lines of Angular Ionic code across 150 files as part of a comparative study on 5 mobile app platforms",
        "Evaluated setup, learning curve, and maintainability by developing a full mobile app with 114 commits over 3 months",
        "Diagnosed persistent incompatibilities between AWS Amplify and Angular, leading to a successful migration to Firebase",
        "Synthesized findings across 15 key metrics, including build complexity, documentation quality, and dev efficiency, contributing to a 20-page technical report"
      ]
    },
    {
      "logo": null,
      "title": "Software Consultant",
      "company": "Self-Employed",
      "employmentType": "Freelance",
      "start": "Jan 2022",
      "end": "Sep 2023",
      "location": "Saratoga Springs, Utah, United States",
      "locationType": "Remote",
      "bullets": [
        "Designed and delivered 4 custom Python-based solutions totaling 3K+ lines of code and 130 commits, spanning GUI development, image metadata tools, facial tracking via OpenCV, and SQL-based file management systems",
        "Independently built a 3D scene renderer from scratch with only NumPy and OpenCV to visualize facial tracking data—an unrequested tool that impressed the client and enhanced calibration accuracy"
      ]
    }
  ]
}